---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.AnalysisDateAndTime
source: html/d16ea8b2-d425-f8ef-7c0b-d1023fe9c81d.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.AnalysisDateAndTime Property

Identifies the analysis date and time when it was requested.

## Syntax (C#)
```csharp
public DateTime AnalysisDateAndTime { get; }
```